#+TODO: TODO(t) STARTED(s) DELEGATED(d) SOMEDAY(.) WAITING(w) | DONE(x) CANCELLED(c)
#+TODO: NEW(n) BEGINNER(b) INTERMEDIATE(i) | COMFORTABLE(x)
#+PROPERTY: QUANTIFIED Emacs
#+FILETAGS: emacs

*** DONE Announce next Hangout May 13
    CLOSED: [2015-05-11 Mon 11:33] SCHEDULED: <2015-05-11 Mon>
    :PROPERTIES:
    :Effort:   0:15
    :QUANTIFIED: Emacs
    :END:
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2015-05-11 Mon 11:33]
    CLOCK: [2015-05-11 Mon 11:29]--[2015-05-11 Mon 11:33] =>  0:04
    :END:

 Emacs Hangout May 13 Wed 9 PM EDT (Toronto time)
 https://plus.google.com/events/cd2t514r76je6jtgab9csenukd4

**** TODO Host Emacs Hangout
     SCHEDULED: <2015-12-21 Mon>
     :PROPERTIES:
     :Effort:   3:00
     :END:
      :LOGBOOK:
      CLOCK: [2015-11-18 Wed 20:39]--[2015-11-18 Wed 23:07] =>  2:28
      :END:

 - [ ] Close other windows
 - [ ] Grab some water
 - [ ] Set up Google Hangout On Air http://hangouts.google.com/onair
 - [ ] Enable Q&A
 - [ ] Copy Youtube and join links http://youtu.be/A4uunJOltj8
 - [ ] Set up redirection http://sachachua.com/blog/wp-admin/tools.php?page=redirection.php
 - [ ] Update event description (see template)
 - [ ] Post as comment as well

#+begin_example
You can join the Hangout at http://sachachua.com/join-emacs-hangout (max 10 people).
- If you'd like to display your name underneath your video, hover over the left side, choose the red icon with a wrench (Hangout Toolbox), click on the circular person icon on the right side, and fill in the Lower Third details.
- To share your screen, hover over the left side, then click on the green icon of a monitor with an arrow.
- There's also a text chat which you can use for asynchronous communication. Note: The text chat is not visible in the streaming video.
- Using headphones or earphones can help avoid audio feedback. Please mute your microphone if you you have a lot of background noise and you're not currently talking.

*If the 10-person limit is reached*, you can watch the livestream on this event page. Use the Q&A feature to ask questions or say if you've got something for show&tell. We can ask someone in the chat to step out so that you can join in. You can also use comments on this event page to share your thoughts.

*What's this Emacs Hangout thing about?* This is an informal way for Emacs geeks to get together and swap tips/notes/questions. You can find out about upcoming Hangouts at https://plus.google.com/b/108840863190686221561/108840863190686221561/posts . Find notes for previous hangouts or sign up for the mailing list at http://sachachua.com/blog/tag/emacs-hangout . The recording will be available from this event page as well. Enjoy, and thanks for coming!
#+end_example

 - [ ] Schedule Twitter http://grabinbox.com - something like:

Emacs Hangout starting now (9 PM EST / GMT-5). Join at http://sach.ac/join-emacs-hangout or watch the stream at http://sach.ac/watch-emacs-hangout .

 - [ ] Announce on IRC (irc.freenode.net #emacs)

Emacs Hangout starting in a bit (9 PM EST / GMT-5). Join at http://sach.ac/join-emacs-hangout (Google account required) or watch the stream at http://sach.ac/watch-emacs-hangout .

 - [ ] Set up Emacs buffer or paper for noting timestamps
   M-x org-timer-start, M-x org-timer-item (M-RET)

After the Hangout:

 - [ ] Copy and clean up the text chat
 - [ ] Post the notes
 - [ ] Update the event page with the link
 - [ ] Add to Emacs Hangouts playlist
 - [ ] Add the notes to the description of the video
 - [ ] Convert to mp3: youtube-dl http://... --extract-audio --audio-format mp3 --prefer-ffmpeg
 - [ ] Change ID3 tags
 - [ ] Upload MP3
 - [ ] Revert redirection to http://sachachua.com/blog/tag/emacs-hangout


**** DONE Organize Emacs Hangout 2015-11-18
     CLOSED: [2015-11-13 Fri 16:36]
     :PROPERTIES:
     :Effort:   0:30
     :QUANTIFIED: Emacs
     :END:
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2015-11-13 Fri 16:36]
     CLOCK: [2015-11-13 Fri 16:02]--[2015-11-13 Fri 16:36] =>  0:34
     :END:
  November 18, 9 PM EST
**** DONE Announce Emacs Hangout
     CLOSED: [2015-11-17 Tue 13:48] SCHEDULED: <2015-11-16 Mon>
     :PROPERTIES:
     :Effort:   0:15
     :END:
      :LOGBOOK:
      - State "DONE"       from "STARTED"    [2015-11-17 Tue 13:48]
      CLOCK: [2015-11-16 Mon 14:49]--[2015-11-17 Tue 13:48] => 22:59
      :END:

   November 18, 9-10:30 PM EST (GMT -5)
   https://plus.google.com/events/cpef1jv0oq673aneiigh7q5n7lk

 Hi folks!

 Time for another Emacs Hangout this Wednesday (Nov 18), starting at 9 PM EDT (GMT-5). https://sachachua.com/emacs-hangout has details, and Google+ should automatically translate the time there to your timezone. I'll post instructions for joining a few minutes before the event starts. If it's full or you prefer to lurk, you can go to that URL to watch the stream.

 If this time is inconvenient for you, get in touch with me and suggest a few dates/times when you might want to have an Emacs Hangout. I'd be happy to see if we can work out a good time, or to share my processes for hosting these so that you can hold an hangout of your own. (It's totally informal. =) )

 Hope to see you there!
 Sacha

**** DONE Host Emacs Hangout
     CLOSED: [2015-11-18 Wed 23:07] SCHEDULED: <2015-11-18 Wed 21:00>
     :PROPERTIES:
     :Effort:   3:00
     :END:
      :LOGBOOK:
      CLOCK: [2015-11-18 Wed 20:39]--[2015-11-18 Wed 23:07] =>  2:28
      :END:

 - [X] Close other windows
 - [X] Grab some water
 - [X] Set up Google Hangout On Air http://hangouts.google.com/onair
 - [X] Enable Q&A
 - [X] Copy Youtube and join links http://youtu.be/A4uunJOltj8
 - [X] Set up redirection http://sachachua.com/blog/wp-admin/tools.php?page=redirection.php
 - [X] Update event description (see template)
 - [X] Post as comment as well

#+begin_example
You can join the Hangout at http://sachachua.com/join-emacs-hangout (max 10 people).
- If you'd like to display your name underneath your video, hover over the left side, choose the red icon with a wrench (Hangout Toolbox), click on the circular person icon on the right side, and fill in the Lower Third details.
- To share your screen, hover over the left side, then click on the green icon of a monitor with an arrow.
- There's also a text chat which you can use for asynchronous communication. Note: The text chat is not visible in the streaming video.
- Using headphones or earphones can help avoid audio feedback. Please mute your microphone if you you have a lot of background noise and you're not currently talking.

*If the 10-person limit is reached*, you can watch the livestream on this event page. Use the Q&A feature to ask questions or say if you've got something for show&tell. We can ask someone in the chat to step out so that you can join in. You can also use comments on this event page to share your thoughts.

*What's this Emacs Hangout thing about?* This is an informal way for Emacs geeks to get together and swap tips/notes/questions. You can find out about upcoming Hangouts at https://plus.google.com/b/108840863190686221561/108840863190686221561/posts . Find notes for previous hangouts or sign up for the mailing list at http://sachachua.com/blog/tag/emacs-hangout . The recording will be available from this event page as well. Enjoy, and thanks for coming!
#+end_example

 - [X] Schedule Twitter http://grabinbox.com - something like:

Emacs Hangout starting now (9 PM EST / GMT-5). Join at http://sach.ac/join-emacs-hangout or watch the stream at http://sach.ac/watch-emacs-hangout .

 - [X] Announce on IRC (irc.freenode.net #emacs)

Emacs Hangout starting in a bit (9 PM EST / GMT-5). Join at http://sach.ac/join-emacs-hangout (Google account required) or watch the stream at http://sach.ac/watch-emacs-hangout .

 - [ ] Set up Emacs buffer or paper for noting timestamps
   M-x org-timer-start, M-x org-timer-item (M-RET)

After the Hangout:

 - [X] Copy and clean up the text chat
 - [X] Post the notes
 - [X] Update the event page with the link
 - [X] Add to Emacs Hangouts playlist
 - [X] Add the notes to the description of the video
 - [X] Convert to mp3: youtube-dl http://... --extract-audio --audio-format mp3 --prefer-ffmpeg
 - [ ] Change ID3 tags
 - [X] Upload MP3
 - [X] Revert redirection to http://sachachua.com/blog/tag/emacs-hangout

**** DONE 2015-05-13 Emacs Hangout                                    :emacs:
     :PROPERTIES:
     :Effort:   3:00
     :ID:       o2b:a6432935-8231-426c-a8e4-b2a83f8570d9
     :POST_DATE: [2015-05-13 Wed 23:03]
     :POSTID:   28207
     :BLOG:     sacha
     :END:
     :LOGBOOK:
     CLOCK: [2015-05-13 Wed 20:28]--[2015-05-14 Thu 18:47] => 22:19
     :END:

Console Emacs vs GUI Emacs, keybindings, Org Mode, cooking, nyan, window management, calendars, SuperCollider

Usual disclaimer: times are approximate, and the note-taker often gets distracted. =)

#+begin_html
<iframe width="640" height="360" src="https://www.youtube.com/embed/hOYd1GePFV0" frameborder="0" allowfullscreen></iframe>
#+end_html

  - [[https://www.youtube.com/watch?v=hOYd1GePFV0&t=0h00m00s][0:00:00]]  Emacs configuration
  - [[https://www.youtube.com/watch?v=hOYd1GePFV0&t=0h11m22s][0:11:22]]  Console Emacs vs GUI Emacs? iTerm integration, mouse support, 256 colours, drop-down menus (although you can get a text one), ...
  - [[https://www.youtube.com/watch?v=hOYd1GePFV0&t=0h14m59s][0:14:59]]  multihop TRAMP
  - [[https://www.youtube.com/watch?v=hOYd1GePFV0&t=0h16m01s][0:16:01]]  keybinding philosophies, Hyper and Super
  - [[https://www.youtube.com/watch?v=hOYd1GePFV0&t=0h22m15s][0:22:15]]  Remapping keys on Mac OS X (dealing with separate Alt and Meta)
  - [[https://www.youtube.com/watch?v=hOYd1GePFV0&t=0h28m04s][0:28:04]]  Org and mobile
  - [[https://www.youtube.com/watch?v=hOYd1GePFV0&t=0h30m25s][0:30:25]]  emulating hyper and super keys
  - [[https://www.youtube.com/watch?v=hOYd1GePFV0&t=0h32m15s][0:32:15]]  orgzly
  - [[https://www.youtube.com/watch?v=hOYd1GePFV0&t=0h33m33s][0:33:33]]  Org Mode and cooking, org-map-entries
  - [[https://www.youtube.com/watch?v=hOYd1GePFV0&t=0h39m31s][0:39:31]]  nyan
  - [[https://www.youtube.com/watch?v=hOYd1GePFV0&t=0h43m04s][0:43:04]]  One window, workgroups
  - [[https://www.youtube.com/watch?v=hOYd1GePFV0&t=0h46m56s][0:46:56]]  winner-mode
  - [[https://www.youtube.com/watch?v=hOYd1GePFV0&t=0h53m30s][0:53:30]]  rinari, zeus, ruby
  - [[https://www.youtube.com/watch?v=hOYd1GePFV0&t=0h54m53s][0:54:53]]  neotree
  - [[https://www.youtube.com/watch?v=hOYd1GePFV0&t=0h58m22s][0:58:22]]  keyboards
  - [[https://www.youtube.com/watch?v=hOYd1GePFV0&t=1h03m24s][1:03:24]]  conference
  - [[https://www.youtube.com/watch?v=hOYd1GePFV0&t=1h09m22s][1:09:22]]  calw; also, something about rainbow-mode, and palette, and then later Org Mode
  - [[https://www.youtube.com/watch?v=hOYd1GePFV0&t=1h23m13s][1:23:13]]  SuperCollider, Overtone, yasnippet
  - [[https://www.youtube.com/watch?v=hOYd1GePFV0&t=1h45m13s][1:45:13]]  blackink?

Text chat:

| Sahil Sinha | 9:23 PM | [[http://emacswiki.org/emacs/MetaKeyProblems][http://emacswiki.org/emacs/MetaKeyProblems]] |
| Jack G. | 9:24 PM | (setq mac-right-command-modifier 'hyper)<br>(setq mac-right-option-modifier 'super) [[http://ergoemacs.org/emacs/emacs_hyper_super_keys.html][http://ergoemacs.org/emacs/emacs_hyper_super_keys.html]] (global-set-key (kbd "H-h") 'er/expand-region |
| George Jones | 9:32 PM | [[https://github.com/heikkil/org-dropbox][https://github.com/heikkil/org-dropbox]] |
| Jack G. | 9:36 PM | nyan Cranky_walk.gif |
Jack G. | 9:42 PM | Here's the gif I have as my nyan [[http://vignette3.wikia.nocookie.net/donkeykong/images/9/91/Cranky_walk.gif/revision/latest?cb=20100930155227][http://vignette3.wikia.nocookie.net/donkeykong/images/9/91/Cranky_walk.gif/revision/latest?cb=20100930155227]] |
| me | 9:42 PM | [[http://www.emacswiki.org/emacs/OneWindow][http://www.emacswiki.org/emacs/OneWindow]] ? |
| Daniel H | 9:46 PM | [[https://github.com/tlh/workgroups.el][https://github.com/tlh/workgroups.el]] |
| me | 9:48 PM | [[http://askubuntu.com/questions/4820/keeping-emacs-from-splitting-the-window-when-openning-multiple-files][http://askubuntu.com/questions/4820/keeping-emacs-from-splitting-the-window-when-openning-multiple-files]] winner-mode |
| George Jones | 9:59 PM | [[http://ergoemacs.org/emacs/emacs_best_keyboard.html][http://ergoemacs.org/emacs/emacs_best_keyboard.html]] |
| George Jones | 9:59 PM | Xah Lee writes a LOT about keyboards |
| Jack G. | 10:02 PM | [[http://www.razerzone.com/ca-en/store/razer-anansi][http://www.razerzone.com/ca-en/store/razer-anansi]] |
| Bogdan Popa | 10:10 PM | [[https://github.com/kiwanami/emacs-calfw#for-ical-google-calendar-users][https://github.com/kiwanami/emacs-calfw#for-ical-google-calendar-users]] |
| me | 10:11 PM | org-gcal |
| Daniel H | 10:12 PM | [[https://github.com/kiwanami/emacs-calfw][https://github.com/kiwanami/emacs-calfw]] |
| George Jones | 10:12 PM | having real trouble hearing... |
| George Jones | 10:20 PM | when you open a  PDF in docview you can get the text with ^C^T (default bindings) |
| Jack G. | 10:21 PM | Thanks George! |
| George Jones | 10:21 PM | C-c C-t runs the command doc-view-open-text |
| me | 10:27 PM | [[http://doc.norang.ca/org-mode.html][http://doc.norang.ca/org-mode.html]] |
| sai tejaa Cluri | 10:27 PM | hi |
| Jack G. | 10:37 PM | [[https://www.google.ca/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;cad=rja&amp;uact=8&amp;ved=0CB4QtwIwAA&amp;url=https%3A%2F%2Fvimeo.com%2F22798433&amp;ei=QQpUVYvkDY7boATNoYBg&amp;usg=AFQjCNFWP2p0lzfnV9O8Ln8Xj700X64xpg&amp;sig2=imdZEfZtqo06MSjnb2i71Q][https://www.google.ca/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;cad=rja&amp;uact=8&amp;ved=0CB4QtwIwAA&amp;url=https%3A%2F%2Fvimeo.com%2F22798433&amp;ei=QQpUVYvkDY7boATNoYBg&amp;usg=AFQjCNFWP2p0lzfnV9O8Ln8Xj700X64xpg&amp;sig2=imdZEfZtqo06MSjnb2i71Q]] |
| me | 10:37 PM | This was a fun demo of Org Mode and SuperCollider [[http://pages.sachachua.com/emacs-chats/chat-iannis-zannos.html][http://pages.sachachua.com/emacs-chats/chat-iannis-zannos.html]] |
| Levi Strope | 10:40 PM | Jack your audio is crystal clear now... whatever that change was |
| Jack G. | 10:45 PM | [[http://blackink.bleank.com][http://blackink.bleank.com]] |
| me | 10:48 PM | [[http://emacslife.com/baby-steps-org.html][http://emacslife.com/baby-steps-org.html]] |



*** DONE Take a look at intro and outro for Emacs Hangout
    CLOSED: [2015-05-19 Tue 12:51]
    :PROPERTIES:
    :Effort:   0:15
    :QUANTIFIED: Emacs
    :END:
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2015-05-19 Tue 12:51]
    CLOCK: [2015-05-19 Tue 12:49]--[2015-05-19 Tue 12:51] =>  0:02
    :END:
*** TODO Do another Emacs News review
    SCHEDULED: <2015-12-14 Mon +1w>
    :PROPERTIES:
    :Effort:   1:30
    :QUANTIFIED: Emacs
    :CLOCK_MODELINE_TOTAL: today
    :POSTID:   28441
    :POST_DATE: 20151026T17:18:00+0000
    :Published: No
    :LAST_REPEAT: [2015-12-07 Mon 11:25]
    :END:
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2015-12-07 Mon 11:25]
    CLOCK: [2015-12-07 Mon 10:36]--[2015-12-07 Mon 11:25] =>  0:49
    - State "DONE"       from "STARTED"    [2015-11-30 Mon 11:18]
    CLOCK: [2015-11-30 Mon 10:31]--[2015-11-30 Mon 11:18] =>  0:47
    - State "DONE"       from "STARTED"    [2015-11-23 Mon 11:33]
    CLOCK: [2015-11-23 Mon 10:18]--[2015-11-23 Mon 11:33] =>  1:15
    - State "DONE"       from "STARTED"    [2015-11-16 Mon 14:49]
    CLOCK: [2015-11-16 Mon 12:21]--[2015-11-16 Mon 13:46] =>  1:25
    - State "DONE"       from "STARTED"    [2015-11-09 Mon 10:06]
    CLOCK: [2015-11-09 Mon 09:01]--[2015-11-09 Mon 10:27] =>  1:26
    - State "DONE"       from "STARTED"    [2015-11-02 Mon 12:31]
    CLOCK: [2015-11-02 Mon 11:40]--[2015-11-02 Mon 12:33] =>  0:53
    - State "DONE"       from "STARTED"    [2015-10-26 Mon 13:26]
    CLOCK: [2015-10-26 Mon 11:34]--[2015-10-26 Mon 13:26] =>  1:52
    :END:

**** DONE Set up Emacs News mailing list
     CLOSED: [2015-11-10 Tue 20:09]
     :PROPERTIES:
     :Effort:   0:15
     :QUANTIFIED: Emacs
     :END:
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2015-11-10 Tue 20:09]
     CLOCK: [2015-11-10 Tue 19:59]--[2015-11-10 Tue 20:09] =>  0:10
     :END:
*** DONE Queue Emacs News updates
    CLOSED: [2015-11-17 Tue 13:56]
    :PROPERTIES:
    :Effort:   0:30
    :END:
    :LOGBOOK:
    CLOCK: [2015-11-17 Tue 12:44]--[2015-11-17 Tue 13:58] =>  1:14
    :END:

*** DONE Set up Emacs News mailing list
    CLOSED: [2015-11-10 Tue 20:09]
    :PROPERTIES:
    :Effort:   0:15
    :QUANTIFIED: Emacs
    :END:
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2015-11-10 Tue 20:09]
    CLOCK: [2015-11-10 Tue 19:59]--[2015-11-10 Tue 20:09] =>  0:10
    :END:
*** DONE Update missing podcast episode
    CLOSED: [2015-11-07 Sat 11:31] SCHEDULED: <2015-11-07 Sat>
    :PROPERTIES:
    :Effort:   0:15
    :QUANTIFIED: Emacs
    :END:
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2015-11-07 Sat 11:31]
    CLOCK: [2015-11-07 Sat 11:03]--[2015-11-07 Sat 11:31] =>  0:28
    :END:
  2015-11-07 11:02

 http://askubuntu.com/questions/178481/how-to-download-an-mp3-track-from-a-youtube-video
 youtube-dl https://www.youtube.com/watch?v=QRBcm6jFJ3Q --extract-audio --audio-format mp3  --prefer-ffmpeg

 How do I edit mp3 tags again? Ah, I just have to be in the directory view.
**** DONE Set up for chat with John Wiegley
     CLOSED: [2015-12-10 Thu 16:50] SCHEDULED: <2015-12-10 Thu 16:30>
     :PROPERTIES:
     :Effort:   0:30
     :END:
     :LOGBOOK:
     CLOCK: [2015-12-10 Thu 16:21]--[2015-12-10 Thu 16:50] =>  0:29
     :END:

 http://hangouts.google.com/onair

  - [X] Close other windows
  - [X] Grab some water
  - [X] Set up Google Hangout On Air
  - [X] Enable Q&A
  - [X] Copy Youtube and join links 
  - [X] Update event description (see template)
  - [ ] Post as comment as well

**** DONE Chat with John Wiegley about Emacs maintainership etc.
     CLOSED: [2015-12-10 Thu 17:54] SCHEDULED: <2015-12-10 Thu 17:00>
     :PROPERTIES:
     :Effort:   1:00
     :END:
     :LOGBOOK:
     CLOCK: [2015-12-10 Thu 16:51]--[2015-12-10 Thu 17:54] =>  1:03
     :END:
 https://plus.google.com/events/c2l1cl3vdt3l9s282adb2a5cfps
**** DONE 2015-12-10 Emacs Chat: John Wiegley on maintaining Emacs and how you can help  :emacs:emacs-chat:
     CLOSED: [2015-12-10 Thu 18:23]
     :PROPERTIES:
     :Effort:   0:30
     :ID:       o2b:a93af4a8-4061-4b1c-8ee6-9cc9e430fb3a
     :POST_DATE: [2015-12-10 Thu 18:02]
     :POSTID:   28511
     :BLOG:     sacha
     :END:
     :LOGBOOK:
     CLOCK: [2015-12-10 Thu 17:55]--[2015-12-10 Thu 18:23] =>  0:28
     :END:

 John Wiegley shared how he uses Gnus and Org to help him with the
 volume of Emacs-related information, and how people can get started
 with Emacs development.

 #+HTML: <iframe width="640" height="360" src="https://www.youtube.com/embed/nUjgKoOYxos" frameborder="0" allowfullscreen></iframe>

 - [[https://www.youtube.com/watch?v=nUjgKoOYxos&t=0h02m0s][0:02]]  Gnus for mail and news
 - [[https://www.youtube.com/watch?v=nUjgKoOYxos&t=0h04m0s][0:04]]  Organizing groups by topic
 - [[https://www.youtube.com/watch?v=nUjgKoOYxos&t=0h05m0s][0:05]]  Adaptive scoring and prioritization
 - [[https://www.youtube.com/watch?v=nUjgKoOYxos&t=0h09m0s][0:09]]  Setup for mail: Gmail, Fetchmail, Dovecot, Gnus
 - [[https://www.youtube.com/watch?v=nUjgKoOYxos&t=0h11m0s][0:11]]  Time: 1-2 hours a day
 - [[https://www.youtube.com/watch?v=nUjgKoOYxos&t=0h13m0s][0:13]]  Community-building
 - [[https://www.youtube.com/watch?v=nUjgKoOYxos&t=0h15m0s][0:15]]  Using Org to keep track of initiatives
 - [[https://www.youtube.com/watch?v=nUjgKoOYxos&t=0h19m0s][0:19]]  Reading bug reports in Gnus
 - [[https://www.youtube.com/watch?v=nUjgKoOYxos&t=0h22m0s][0:22]]  How people can help: tests, documentation, reviewing bugs
 - [[https://www.youtube.com/watch?v=nUjgKoOYxos&t=0h24m0s][0:24]]  Coverage
 - [[https://www.youtube.com/watch?v=nUjgKoOYxos&t=0h33m0s][0:33]]  Efficiency, benchmarks
 - [[https://www.youtube.com/watch?v=nUjgKoOYxos&t=0h40m0s][0:40]]  Magit, Projectile, Flycheck
 - [[https://www.youtube.com/watch?v=nUjgKoOYxos&t=0h45m0s][0:45]]  Following up on emacs-devel topics: IDEs, APIs, lexical binding, Guile, etc.


*** DONE Announce johnw/sachac EmacsCast
    CLOSED: [2015-12-09 Wed 15:47] SCHEDULED: <2015-12-09 Wed>
    :PROPERTIES:
    :Effort:   0:15
    :END:
    :LOGBOOK:
    CLOCK: [2015-12-09 Wed 15:38]--[2015-12-09 Wed 15:47] =>  0:09
    :END:

- Set up Google+ Event
- Set up redirection - maybe 

*** DONE Cut the rest of the Emacs videos
    :PROPERTIES:
    :Effort:   4:00
    :END:
    :LOGBOOK:
    CLOCK: [2015-09-23 Wed 11:01]--[2015-09-23 Wed 11:10] =>  0:09
    :END:

*** CANCELLED Make it easier to bookmark sections of guide
	 	CLOSED: [2014-05-01 Thu 18:05]
    :PROPERTIES:
    :END:
	 	:LOGBOOK:
	 	CLOCK: [2014-04-30 Wed 18:55]--[2014-04-30 Wed 19:15] =>  0:20
	 	:END:
	 	:PROPERTIES:
	 	:Effort:   1:00
	 	:END:
** DONE Set up hydra for quick logging of Quantified Awesome things
   CLOSED: [2015-11-11 Wed 19:35] SCHEDULED: <2015-11-11 Wed>
   :PROPERTIES:
   :Effort:   0:30
   :QUANTIFIED: Emacs
   :END:
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2015-11-11 Wed 19:35]
   CLOCK: [2015-11-11 Wed 19:24]--[2015-11-11 Wed 19:25] =>  0:01
   - State "CANCELLED"  from "STARTED"    [2015-11-11 Wed 19:23] \\
     Cancelled because it generally makes sense to tie these to individual tasks. Except maybe walk and clean the kitchen? Hmm. Okay, maybe it is worth it.
   CLOCK: [2015-11-11 Wed 19:20]--[2015-11-11 Wed 19:23] =>  0:03
   :END:
** DONE Figure out where org-add-log-note is messing up
   CLOSED: [2015-11-11 Wed 19:14] SCHEDULED: <2015-11-11 Wed>
   :PROPERTIES:
   :Effort:   0:30
   :QUANTIFIED: Emacs
   :END:
   :LOGBOOK:
   CLOCK: [2015-11-11 Wed 19:14]--[2015-11-11 Wed 19:14] =>  0:00
   :END:
** DONE Add today's agenda to refile targets
   CLOSED: [2015-11-11 Wed 19:13] SCHEDULED: <2015-11-11 Wed>
   :PROPERTIES:
   :Effort:   0:30
   :QUANTIFIED: emacs
   :END:
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2015-11-11 Wed 19:13]
   CLOCK: [2015-11-11 Wed 18:37]--[2015-11-11 Wed 19:13] =>  0:36
   CLOCK: [2015-11-11 Wed 18:34]--[2015-11-11 Wed 19:14] =>  0:40
   :END:

Based on [[http://emacs.stackexchange.com/questions/4063/how-to-get-the-raw-data-for-an-org-mode-agenda-without-an-agenda-view][How to get the raw data for an org-mode agenda without an agenda view? - Emacs Stack Exchange]]

#+begin_src emacs-lisp
  (defun my/org-get-todays-items-as-refile-candidates ()
    "Return items scheduled for today, ready for choosing during refiling."
    (delq
     nil
     (mapcar
      (lambda (s)
        (if (get-text-property 0 'org-marker s)
            (list
             s
             (buffer-file-name (marker-buffer (get-text-property 0 'org-marker s)))
             nil
             (marker-position (get-text-property 0 'org-marker s)))))
      (save-window-excursion (my/org-get-entries-fn (calendar-current-date) (calendar-current-date))))))

  (defun my/org-get-entries-fn (begin end)
  "Return org schedule items between BEGIN and END.
  USAGE:  (org-get-entries-fn '(6 1 2015) '(6 30 2015))"
    (require 'calendar)
    (require 'org)
    (require 'org-agenda)
    (require 'cl)
    (unless
        (and
          (calendar-date-is-valid-p begin)
          (calendar-date-is-valid-p end))
      (let ((debug-on-quit nil))
        (signal 'quit `("One or both of your gregorian dates are invalid."))))
    (let* (
        result
        (org-agenda-prefix-format "  • ")
        (org-agenda-entry-types '(:scheduled))
        (date-after
          (lambda (date num)
            "Return the date after NUM days from DATE."
            (calendar-gregorian-from-absolute
             (+ (calendar-absolute-from-gregorian date) num))))
        (enumerate-days
          (lambda (begin end)
            "Enumerate date objects between BEGIN and END."
            (when (> (calendar-absolute-from-gregorian begin)
                     (calendar-absolute-from-gregorian end))
              (error "Invalid period : %S - %S" begin end))
            (let ((d begin) ret (cont t))
              (while cont
                (push (copy-sequence d) ret)
                (setq cont (not (equal d end)))
                (setq d (funcall date-after d 1)))
              (nreverse ret)))) )
      (org-agenda-reset-markers)
      (setq org-agenda-buffer
        (when (buffer-live-p org-agenda-buffer)
          org-agenda-buffer))
      (org-compile-prefix-format nil)
      (setq result
        (loop for date in (funcall enumerate-days begin end) append
          (loop for file in (org-agenda-files nil 'ifmode)
            append
            (progn
              (org-check-agenda-file file)
              (apply 'org-agenda-get-day-entries file date org-agenda-entry-types)))))
      (unless (buffer-live-p (get-buffer org-agenda-buffer-name))
        (get-buffer-create org-agenda-buffer-name))
      (with-current-buffer (get-buffer org-agenda-buffer-name)
        (org-agenda-mode)
        (setq buffer-read-only t)
        (let ((inhibit-read-only t))
          (erase-buffer))
        (mapcar
          (lambda (x)
            (let ((inhibit-read-only t))
              (insert (format "%s" x) "\n")))
          result))
  ;;    (display-buffer org-agenda-buffer-name t)
      result))
#+end_src
** TODO Sort out org-contacts integration with Gnus
   :PROPERTIES:
   :Effort:   1:00
   :QUANTIFIED: Emacs
   :END:
   :LOGBOOK:
   CLOCK: [2015-02-17 Tue 14:37]--[2015-02-17 Tue 14:58] =>  0:21
   CLOCK: [2015-02-17 Tue 14:37]--[2015-02-17 Tue 14:37] =>  0:00
   :END:

So that:
- =:= shows the person's contact entry
- =;= lets me add a note (org-capture)
- capturing takes the reply-to if needed
** DONE Set up org-gcal
   CLOSED: [2015-12-05 Sat 16:16]
   :PROPERTIES:
   :Effort:   1:00
   :END:
   :LOGBOOK:
   CLOCK: [2015-12-05 Sat 16:11]--[2015-12-05 Sat 16:16] =>  0:05
   :END:

 https://github.com/myuhe/org-gcal.el

 [[file:~/elisp/org-mode/lisp/org-protocol.el::;;;%20org-protocol.el%20---%20Intercept%20calls%20from%20emacsclient%20to%20trigger%20custom%20actions.]]
** DONE Update patch based on Aaron's feedback
   CLOSED: [2015-12-07 Mon 19:28] SCHEDULED: <2015-12-07 Mon>
   :PROPERTIES:
   :Effort:   2:00
   :CREATED:  [2015-12-05 Sat 18:02]
   :END:
   :LOGBOOK:
   CLOCK: [2015-12-07 Mon 11:49]--[2015-12-07 Mon 12:52] =>  1:03
   :END:
 Captured 2015-12-05 09:52

Pass the property list as the only parameter, and condition-case off that 


** DONE Sort out stylus clicks in Emacs
   CLOSED: [2015-12-04 Fri 21:43] SCHEDULED: <2015-12-04 Fri>
   :PROPERTIES:
   :Effort:   0:30
   :END:
   :LOGBOOK:
   CLOCK: [2015-12-04 Fri 20:18]--[2015-12-04 Fri 20:43] =>  0:25
   :END:
 2015-12-04 20:18

It looks like the stylus reports mouse-movement event right away, so thet in cancels the button press.
Yup, that was it. If I comment out the check for mouse-movement, it's okay. I never drag with my mouse anyway, so maybe I should just override this in my config. 
** DONE [#B] Update patch based on Rasmus' feedback
   CLOSED: [2015-12-04 Fri 17:59] SCHEDULED: <2015-12-04 Fri>
   :PROPERTIES:
   :Effort:   0:30
   :END:
   :LOGBOOK:
   CLOCK: [2015-12-04 Fri 14:05]--[2015-12-04 Fri 17:59] =>  3:54
   :END:
 2015-12-02 16:29
 [[gnus:nntp+news.gmane.org:gmane.emacs.orgmode#87zixswsrz.fsf@pank.eu][Email from rasmus@gmx.us: Re: {PATCH} org-protocol: Allo]]

[[http://shingofukuyama.github.io/emacs-magit-reword-commit-messages/][Emacs Magit tutorial | Rewrite older commit messages – Shingo Fukuyama – Web & iOS Developer in Japan]]

** DONE [#C] Look into org-agenda-sorting-strategy and tag-up
   CLOSED: [2015-12-01 Tue 16:56] SCHEDULED: <2015-12-01 Tue>
   :PROPERTIES:
   :Effort:   0:30
   :END:
   :LOGBOOK:
   CLOCK: [2015-12-01 Tue 16:55]--[2015-12-01 Tue 16:56] =>  0:01
   :END:
 2015-11-30 22:42
 
** DONE Make invoice template in Org Mode 
   CLOSED: [2015-11-30 Mon 13:26]
   :PROPERTIES:
   :Effort:   0:30
   :END:
   :LOGBOOK:
   CLOCK: [2015-11-30 Mon 11:32]--[2015-11-30 Mon 13:26] =>  1:54
   :END:
so that I don't have to switch to Windows for that
http://notes.secretsauce.net/notes/2014/10/01_org-mode-for-invoices.html

[[file:~/Dropbox/business/Paperwork/invoices.org::*Invoice%20date:%202015-12-01][Invoice date: 2015-12-01]]


** DONE Make a fill-in drill based on an Org table
   CLOSED: [2015-11-30 Mon 11:28]
   :PROPERTIES:
   :Effort:   2:00
   :END:
   :LOGBOOK:
   CLOCK: [2015-11-26 Thu 19:47]--[2015-11-26 Thu 20:18] =>  0:31
   :END:

** TODO [#C] Modify art-bollocks to include more weaselly words
   :PROPERTIES:
   :Effort:   1:00
   :END:
   :LOGBOOK:
   CLOCK: [2015-01-06 Tue 13:39]--[2015-01-06 Tue 13:47] =>  0:08
   :END:
** DONE Investigate org toc local section
   CLOSED: [2015-11-28 Sat 00:02]
   :PROPERTIES:
   :Effort:   1:00
   :END:
   :LOGBOOK:
   CLOCK: [2015-11-27 Fri 23:42]--[2015-11-28 Sat 00:02] =>  0:20
   CLOCK: [2015-11-27 Fri 22:41]--[2015-11-27 Fri 23:13] =>  0:32
   :END:
** BEGINNER web-mode
   :PROPERTIES:
   :END:
   :LOGBOOK:
   CLOCK: [2014-11-06 Thu 20:44]--[2014-11-06 Thu 20:57] =>  0:13
   :END:
   :PROPERTIES:
   :Effort:   0:30
   :END:
C-c C-f for code folding
C-c C-n between tags
C-c C-s snippets?
C-c C-m selection and expansion
C-c C-i indent entire buffer
C-c C-d d show tag mismatch
C-c C-e b element beginning, c clone, d down, e end, i inner, k kill, n next, p previous, r rename, s select, v vanish (like splicing)

** DONE Check out yaoddmuse - johnw
   CLOSED: [2015-11-20 Fri 09:56] SCHEDULED: <2015-11-20 Fri>
   :PROPERTIES:
   :Effort:   0:30
   :QUANTIFIED: Emacs
   :END:
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2015-11-20 Fri 09:56]
   CLOCK: [2015-11-11 Wed 19:14]--[2015-11-11 Wed 19:15] =>  0:01
   :END:

** DONE Write GetHelp page
   CLOSED: [2015-11-17 Tue 12:43]
   :PROPERTIES:
   :Effort:   0:30
   :QUANTIFIED: Emacs
   :END:
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2015-11-17 Tue 12:43]
   CLOCK: [2015-11-17 Tue 11:31]--[2015-11-17 Tue 12:43] =>  1:12
   :END:
** DONE Write about setup for e-mail
   CLOSED: [2015-11-20 Fri 12:40] SCHEDULED: <2015-11-20 Fri>
   :PROPERTIES:
   :Effort:   0:30
   :END:
   :LOGBOOK:
   CLOCK: [2015-11-20 Fri 12:25]--[2015-11-20 Fri 12:40] =>  0:15
   :END:
http://sachachua.com/blog/2015/11/2015-11-18-emacs-hangout/

** DONE Improve EmacsWiki
   CLOSED: [2015-11-24 Tue 20:51]
   :PROPERTIES:
   :Effort:   1:00
   :END:
   :LOGBOOK:
   CLOCK: [2015-11-24 Tue 20:18]--[2015-11-24 Tue 20:51] =>  0:33
   :END:

http://www.emacswiki.org/emacs/RecentChanges

*** DONE Update information on customizing initfile
    CLOSED: [2015-11-24 Tue 20:18]
    :PROPERTIES:
    :Effort:   1:00
    :END:
    :LOGBOOK:
    CLOCK: [2015-11-19 Thu 19:06]--[2015-11-19 Thu 20:22] =>  1:16
    :END:
** CANCELLED Check out Memacs                                       :@coding:
   :PROPERTIES:
   :Effort:   1:00
   :QUANTIFIED: Emacs
   :END:
   :LOGBOOK:
   CLOCK: [2014-12-03 Wed 16:55]--[2014-12-03 Wed 17:24] =>  0:29
   :END:

** CANCELLED [#A] Work on Think like an Emacs Geek
   :PROPERTIES:
   :Effort:   0:30
   :CLOCK_MODELINE_TOTAL: today
   :QUANTIFIED: Outlin
   :LAST_REPEAT: [2015-01-01 Thu 23:50]
   :END:
    :LOGBOOK:
    - State "CANCELLED"  from "TODO"       [2015-01-01 Thu 23:50] \\
      On hold for now
    - State "DONE"       from "TODO"       [2014-12-17 Wed 15:24]
    - State "DONE"       from "STARTED"    [2014-12-17 Wed 15:23]
    CLOCK: [2014-12-17 Wed 14:53]--[2014-12-17 Wed 15:23] =>  0:30
    :END:

[[file:~/Dropbox/Public/sharing/index.org::*Books%20to%20write:%20Think%20like%20an%20Emacs%20Geek][Books to write: Think like an Emacs Geek]]
** CANCELLED Investigate org2blog issues to see if I'm comfortable maintaining this
   CLOSED: [2014-12-10 Wed 12:26]
   :PROPERTIES:
   :END:
   :LOGBOOK:
   CLOCK: [2014-11-05 Wed 17:45]--[2014-11-05 Wed 18:01] =>  0:16
   :END:
   :PROPERTIES:
   :Effort:   1:00
   :END:
** DONE Play with melpa stats
   CLOSED: [2015-11-04 Wed 19:19]
   :PROPERTIES:
   :Effort:   1:00
   :END:
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2015-11-04 Wed 19:19]
   CLOCK: [2015-11-04 Wed 19:07]--[2015-11-04 Wed 19:19] =>  0:12
   :END:
http://melpa.org/download_counts.json
http://melpa.org/archive.json

#+begin_src emacs-lisp  :results table
  (let* ((download-counts (json-read-file "g:/code/melpastats/download_counts.json"))
         (archive (json-read-file "g:/code/melpastats/archive.json")))
    (mapcar (lambda (x)
              (let ((package (assoc-default (car x) archive)))
                (list (car x) (assoc-default 'desc package) (cdr x))
                )
              )
            (-slice (sort download-counts (lambda (a b) (> (cdr a) (cdr b))))
                    0 30)))

#+end_src

#+RESULTS:
| dash               | A modern list library for Emacs                                                    | 221234 |
| magit              | A Git porcelain inside Emacs                                                       | 186716 |
| helm               | Helm is an Emacs incremental and narrowing framework                               | 164885 |
| popup              | Visual Popup User Interface                                                        | 156513 |
| auto-complete      | Auto Completion for GNU Emacs                                                      | 153849 |
| s                  | The long lost Emacs string manipulation library.                                   | 151095 |
| flycheck           | On-the-fly syntax checking                                                         | 149235 |
| epl                | Emacs Package Library                                                              | 145994 |
| yasnippet          | Yet another snippet extension for Emacs.                                           | 140048 |
| pkg-info           | Information about packages                                                         | 131203 |
| projectile         | Manage and navigate projects in Emacs easily                                       | 129481 |
| git-commit-mode    | nil                                                                                | 106105 |
| company            | Modular text completion framework                                                  | 104377 |
| undo-tree          | Treat undo history as a tree                                                       | 103989 |
| smartparens        | Automatic insertion, wrapping and paredit-like navigation with user defined pairs. | 103918 |
| markdown-mode      | Emacs Major mode for Markdown-formatted text files                                 | 102899 |
| expand-region      | Increase selected region by semantic units.                                        |  99535 |
| git-rebase-mode    | nil                                                                                |  97035 |
| async              | Asynchronous processing in Emacs                                                   |  94612 |
| f                  | Modern API for working with files and directories                                  |  94252 |
| haskell-mode       | A Haskell editing mode                                                             |  87231 |
| rainbow-delimiters | Highlight brackets according to their depth                                        |  87059 |
| web-mode           | major mode for editing web templates                                               |  85755 |
| zenburn-theme      | A low contrast color theme for Emacs.                                              |  83771 |
| clojure-mode       | Major mode for Clojure code                                                        |  82619 |
| js2-mode           | Improved JavaScript editing mode                                                   |  82370 |
| cider              | Clojure Interactive Development Environment that Rocks                             |  80965 |
| diminish           | Diminished modes are minor modes with no modeline display                          |  76830 |
| smex               | M-x interface with Ido-style fuzzy matching.                                       |  74590 |
| evil               | Extensible Vi layer for Emacs.                                                     |  74546 |

** DONE Fix How to Read Emacs Lisp
   CLOSED: [2015-10-19 Mon 15:09]
   :PROPERTIES:
   :Effort:   0:30
   :QUANTIFIED: Emacs
   :END:
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2015-10-19 Mon 15:09]
   CLOCK: [2015-10-19 Mon 15:03]--[2015-10-19 Mon 15:09] =>  0:06
   :END:

